<a href="https://colab.research.google.com/github/ayanbizz/time-series-analysis/blob/master/1_Creating_a_Time_Series_Object_in_Python_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Importing the Packages

In [2]:
import pandas as pd
import numpy as np

### Importing the data

In [3]:
raw_csv_data = pd.read_csv("Index2018.csv") 
df_comp=raw_csv_data.copy()

### Lenght of the Time Period

In [4]:
df_comp.describe()

               spx           dax         ftse        nikkei
count  6269.000000   6269.000000  6269.000000   6269.000000
mean   1288.127542   6080.063363  5422.713545  14597.055700
std     487.586473   2754.361032  1145.572428   4043.122953
min     438.920000   1911.700000  2876.600000   7054.980000
25%     990.671905   4069.350000  4486.100000  10709.290000
50%    1233.420000   5773.340000  5662.430000  15028.170000
75%    1459.987747   7443.070000  6304.250000  17860.470000
max    2872.867839  13559.600000  7778.637689  24124.150000

In [5]:
df_comp.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [6]:
df_comp.date.describe()

count           6269
unique          6269
top       04/07/2005
freq               1
Name: date, dtype: object

### From Text to Date

In [7]:
df_comp.date = pd.to_datetime(df_comp.date, dayfirst = True)

In [8]:
df_comp.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [9]:
df_comp.date.describe()

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

### Setting the Index

In [10]:
df_comp.set_index("date")

                    spx       dax         ftse    nikkei
date
1994-01-07   469.900000   2224.95  3445.980000  18124.01
1994-01-10   475.270000   2225.00  3440.580000  18443.44
1994-01-11   474.130000   2228.10  3413.770000  18485.25
1994-01-12   474.170000   2182.06  3372.020000  18793.88
1994-01-13   472.470000   2142.37  3360.010000  18577.26
...                 ...       ...          ...       ...
2018-01-23  2839.130362  13559.60  7731.827774  24124.15
2018-01-24  2837.544008  13414.74  7643.428966  23940.78
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[6269 rows x 4 columns]

In [11]:
df_comp.set_index("date", inplace=True)

In [12]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

In [ ]:
#df_comp.date.describe() #Expect to get an error message because we no longer have a "date" column since it is the index

### Setting the Desired Frequency

In [14]:
df_comp=df_comp.asfreq('d')

In [15]:
df_comp

                    spx       dax         ftse    nikkei
date
1994-01-07   469.900000   2224.95  3445.980000  18124.01
1994-01-08          NaN       NaN          NaN       NaN
1994-01-09          NaN       NaN          NaN       NaN
1994-01-10   475.270000   2225.00  3440.580000  18443.44
1994-01-11   474.130000   2228.10  3413.770000  18485.25
...                 ...       ...          ...       ...
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-27          NaN       NaN          NaN       NaN
2018-01-28          NaN       NaN          NaN       NaN
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[8789 rows x 4 columns]

In [16]:
df_comp=df_comp.asfreq('b')

In [17]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Handling Missing Values

In [18]:
df_comp.isna()

              spx    dax   ftse  nikkei
date
1994-01-07  False  False  False   False
1994-01-10  False  False  False   False
1994-01-11  False  False  False   False
1994-01-12  False  False  False   False
1994-01-13  False  False  False   False
...           ...    ...    ...     ...
2018-01-23  False  False  False   False
2018-01-24  False  False  False   False
2018-01-25  False  False  False   False
2018-01-26  False  False  False   False
2018-01-29  False  False  False   False

[6277 rows x 4 columns]

In [19]:
df_comp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [20]:
df_comp

                    spx       dax         ftse    nikkei
date
1994-01-07   469.900000   2224.95  3445.980000  18124.01
1994-01-10   475.270000   2225.00  3440.580000  18443.44
1994-01-11   474.130000   2228.10  3413.770000  18485.25
1994-01-12   474.170000   2182.06  3372.020000  18793.88
1994-01-13   472.470000   2142.37  3360.010000  18577.26
...                 ...       ...          ...       ...
2018-01-23  2839.130362  13559.60  7731.827774  24124.15
2018-01-24  2837.544008  13414.74  7643.428966  23940.78
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[6277 rows x 4 columns]

In [21]:
df_comp.spx=df_comp.spx.fillna(method='ffill')

In [22]:
df_comp.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [23]:
df_comp.ftse=df_comp.ftse.fillna(method='bfill')

In [ ]:
df_comp.dax=df_comp.dax.fillna(value = df_comp.dax.mean())

### Simplifying the Dataset

In [24]:
df_comp['market_value']=df_comp.spx

In [25]:
df_comp.describe()

               spx           dax         ftse        nikkei  market_value
count  6277.000000   6269.000000  6277.000000   6269.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.055700   1288.642547
std     487.868210   2754.361032  1145.568370   4043.122953    487.868210
min     438.920000   1911.700000  2876.600000   7054.980000    438.920000
25%     992.715221   4069.350000  4487.880000  10709.290000    992.715221
50%    1233.761241   5773.340000  5663.300000  15028.170000   1233.761241
75%    1460.250000   7443.070000  6304.630175  17860.470000   1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000   2872.867839

In [26]:
del df_comp['spx']

In [27]:
df_comp.describe()

                dax         ftse        nikkei  market_value
count   6269.000000  6277.000000   6269.000000   6277.000000
mean    6080.063363  5423.690398  14597.055700   1288.642547
std     2754.361032  1145.568370   4043.122953    487.868210
min     1911.700000  2876.600000   7054.980000    438.920000
25%     4069.350000  4487.880000  10709.290000    992.715221
50%     5773.340000  5663.300000  15028.170000   1233.761241
75%     7443.070000  6304.630175  17860.470000   1460.250000
max    13559.600000  7778.637689  24124.150000   2872.867839

In [29]:
del df_comp['dax']
del df_comp['ftse']
del df_comp['nikkei']

In [28]:
df_comp.describe()

                dax         ftse        nikkei  market_value
count   6269.000000  6277.000000   6269.000000   6277.000000
mean    6080.063363  5423.690398  14597.055700   1288.642547
std     2754.361032  1145.568370   4043.122953    487.868210
min     1911.700000  2876.600000   7054.980000    438.920000
25%     4069.350000  4487.880000  10709.290000    992.715221
50%     5773.340000  5663.300000  15028.170000   1233.761241
75%     7443.070000  6304.630175  17860.470000   1460.250000
max    13559.600000  7778.637689  24124.150000   2872.867839

### Splitting the Data

In [32]:
size = int(len(df_comp)*0.8)

In [33]:
df = df_comp.iloc[:size]

In [34]:
df_test = df_comp.iloc[size:]

In [35]:
df.tail()

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [36]:
df_test.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623